results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf5-isr3-msg10240-tps10000-batch131072-acksall-prod6-complz4-trial2/producer-perf-4.log
producer_index=4
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 9357.0 ms avg latency, 9357.0 ms max latency.
1061 records sent, 203.8 records/sec (1.99 MB/sec), 4098.1 ms avg latency, 5120.0 ms max latency.
2956 records sent, 578.0 records/sec (5.64 MB/sec), 5606.8 ms avg latency, 6776.0 ms max latency.
2991 records sent, 590.1 records/sec (5.76 MB/sec), 4875.5 ms avg latency, 5704.0 ms max latency.
8529 records sent, 1702.7 records/sec (16.63 MB/sec), 1773.9 ms avg latency, 5499.0 ms max latency.
16667 records sent, 540.960727 records/sec (5.28 MB/sec), 3041.27 ms avg latency, 9357.00 ms max latency, 3848 ms 50th, 5847 ms 95th, 6412 ms 99th, 6679 ms 99.9th.